[
  {
    "id": "fare-alert-system",
    "slug": "fare-alert-system",
    "collection": "airfare-insights",
    "title": "Fare alert system",
    "description": "Purchasing a flight ticket, though a simple and quick affair, causes lot of anxiety to many travellers even today due to the fact that airlines frequently change fares. Due to this dynamic nature of airfare fluctuation, fare alert system plays a key role in customer engagement and better user experience in travel industry.",
    "published_at": "2017-05-12T00:00:00.000Z"
  },
  {
    "id": "fare-calendar-system",
    "slug": "fare-calendar-system",
    "collection": "airfare-insights",
    "title": "Smart Fare calendar system",
    "description": "Design a simple fare calendar system in order to cluster different price range in respective air route to get a better understanding to price variation throughout the year. Instead of having just minimum, maximum and median airfare to represent three classes of fare distribution in fare calendar,\nwe can design a smart airfare categorization using clustering algorithms.",
    "published_at": "2018-11-27T03:41:56.801Z"
  },
  {
    "id": "coccinelle-usages",
    "slug": "coccinelle-usages",
    "collection": null,
    "title": "Coccinelle",
    "description": "Coccinelle is a program matching tool which allows programmers to easily write some complex style-preserving source-to-source transformations on C source code, for instance, code refactoring.\nThere are useful online resources which document this tool very well, however it is slightly difficult for a beginner to understand these concepts through these materials. So this is my attempt to explain the details of this tool in more convenient way.",
    "published_at": "2016-08-11T00:00:00.000Z"
  },
  {
    "id": "building-datastore-hive",
    "slug": "building-datastore-hive",
    "collection": null,
    "title": "Datastore",
    "description": "Efficient way to construct hive datastore.",
    "published_at": "2018-11-27T03:41:56.801Z"
  },
  {
    "id": "indigo-api-integration",
    "slug": "indigo-api-integration",
    "collection": null,
    "title": "Multivendor airline API aggregator",
    "description": "API aggregration.",
    "published_at": "2018-11-27T03:41:56.802Z"
  },
  {
    "id": "fare-trends",
    "slug": "fare-trends",
    "collection": "airfare-insights",
    "title": "Fare Trends",
    "description": "Pricing for airlines is one of the most volatile and dynamic metric in the travel industry. No wonder, it can drive potential customer really anxious before buying an airline ticket. Thus there is a great need for proper fare analytics and fare trend visualisations for better user experience and hassle free booking.",
    "published_at": "2018-11-27T03:41:56.801Z"
  },
  {
    "id": "y2038-problem",
    "slug": "y2038-problem",
    "collection": null,
    "title": "y2038 issue in linux kernel",
    "description": "The Year 2038 problem or commonly called as y2038 issue is an issue for computing and data storage situations in which time values are stored or calculated as a signed 32-bit integer, and this number is interpreted as the number of seconds since 00:00:00 UTC on 1 January 1970 (the epoch).[1] Such implementations cannot encode times after 03:14:07 UTC on 19 January 2038.",
    "published_at": "2018-11-27T03:41:56.802Z"
  },
  {
    "id": "agent-based-modelling",
    "slug": "agent-based-modelling",
    "collection": "agent-based-modelling",
    "title": "Role of emotions in online communities: An agent based approach",
    "description": "We tend to analyze how people express their emotion in online communities using an agent based approach. We developed an agent based model to see the impact of emotion in integration and disintegration. Further we check the effect of anonymity in the behavior of agents in online communities.",
    "photo": "/images/agent-based-modeling/main-model.png",
    "published_at": "2017-08-11T00:00:00.000Z"
  },
  {
    "id": "supervised-nuclei-segmentation",
    "slug": "supervised-nuclei-segmentation",
    "collection": "machine-learning",
    "title": "Supervised approach for nuclei segmentation",
    "description": "Segmentation is an important stage in almost every problem involving digital image analysis. In image segmentation we aim to partition the spatial domain of the image, thereby delimiting the region of interest which correspond to the target objects in the concerned image analysis.",
    "photo": "/images/nuclei-segmentation/training.jpg",
    "published_at": "2017-08-11T00:00:00.000Z"
  },
  {
    "id": "user-classification",
    "slug": "user-classification",
    "collection": "machine-learning",
    "title": "User classification",
    "description": "Based on the activities performed by the user in travel marketplace, we aim to classify them with certain probability that how likely is the user to book a ticket.",
    "published_at": "2017-03-11T00:00:00.000Z"
  }
]