{
  "id": "tv2mobile-samsung-delhi",
  "slug": "tv2mobile-samsung-delhi",
  "highlightedLanguages": [],
  "source": "---\ndate: 2018-11-01\ntags:\n  - project\n---\n# TV2Mobile @ Samsung, Delhi\n\nIt's an application that Mirrors the Samsung TV screen on to the Mobile phone, Samsung Refrigerator, etc.  ",
  "rendered": "<h1>TV2Mobile @ Samsung, Delhi</h1>\n<p>It's an application that Mirrors the Samsung TV screen on to the Mobile phone, Samsung Refrigerator, etc.</p>\n",
  "attributes": {
    "date": "2018-11-01T00:00:00.000Z",
    "tags": [
      {
        "id": "project",
        "name": "project"
      }
    ],
    "title": "TV2Mobile @ Samsung, Delhi",
    "updated_at": "2018-12-04T03:45:46.024Z",
    "description": "It's an application that Mirrors the Samsung TV screen on to the Mobile phone, Samsung Refrigerator, etc."
  },
  "title": "TV2Mobile @ Samsung, Delhi",
  "description": "It's an application that Mirrors the Samsung TV screen on to the Mobile phone, Samsung Refrigerator, etc.",
  "keywords": [
    "project"
  ],
  "published_at": "2018-11-01T00:00:00.000Z",
  "updated_at": "2018-12-04T03:45:46.024Z",
  "year": 2018,
  "month": 11,
  "day": 2,
  "next": {
    "id": "adhd",
    "slug": "adhd",
    "collection": null,
    "title": "Attention Deficit Hyperactivity Disorder (ADHD) Related Resources",
    "description": "Wikipedia: https://en.wikipedia.org/wiki/Attention_deficit_hyperactivity_disorder",
    "photo": "/images/adhd.jpg",
    "published_at": "2018-11-01T00:00:00.000Z"
  },
  "prev": {
    "id": "snake-robot-with-passive-wheels-and-wireless-contr",
    "slug": "snake-robot-with-passive-wheels-and-wireless-contr",
    "collection": null,
    "title": "Snake Robot with Passive Wheels and Wireless Control",
    "description": "The main objective was to make a robot that had the gait of a snake and can be wirelessly controlled. As students, we had the idea of microcontrollers, motors, and mechanics etc., but it was difficult to zero in on a design. We considered many elaborate designs but rejected them due to the time constraint of three months. We ended up pursuing the Joint and  Edge model, where a sinusoidal wave is transmitted through the connections. When a time delayed sine wave was applied to the joints, it created motion in the forward direction, somewhat similar to how we use roller-skates. The work was divided into categories such as design, procurement of materials, manufacturing of parts, software implementation, and establishing wireless communication. The wireless communication was done using WiFi Direct on ZigBee. I worked on the design, software implementation, and on assembling the robot. I wrote the code using the Arduino IDE, for which I learnt Object Oriented Programming, which helped me write a compact and reusable code. The robot had forward, backward, and turning movement commands which were implemented using the Servo library. The input was received on the ZigBee which transmitted it to the Arduino board. The chassis and joints were also made by the team from Aluminium sheets. We decided to attach passive wheels for smoothness, but we were unable to get the right clips for attaching the wheels.  So, I stepped in to learn Grinding at the Mechanical workshop, and then made all the joint clips by working at the machine. This made me appreciate what Mechanical Engineers did and how the tools and machines help us sculpt things that we imagine. We then assembled the whole robot complete with circuit connections and after a few trials, it worked.",
    "photo": "/images/snake-robot.png",
    "published_at": "2018-11-01T00:00:00.000Z"
  }
}